Step_2/USP_induction_port/mesh1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.016 -0.014 -0.072)
    (0.016 -0.014 -0.072)
    (0.016  0.098  -0.072)
    (-0.016  0.098  -0.072)
    (-0.016 -0.014  0.016)
    (0.016 -0.014  0.016)
    (0.016  0.098   0.016)
    (-0.016  0.098   0.016)
);

blocks
(
//    hex (0 1 2 3 4 5 6 7) (36 112 88) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (18 56 44) simpleGrading (1 1 1)
);

boundary
(
     frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
        );
    }

);

// ************************************************************************* //
